/*!
* jQuery niceDate plugin Russian language translation v0.2
* Author: Silvester Maraž
* Url: http://maraz.org/2011/10/jquery-nicedate/
* Licensed under the MIT license
*/

$.extend($.fn.niceDate.defaults, {

	pattern : 		/([0-3]?[0-9])\.([01]?[0-9])\.(\d{4})\s?(\d{2})?:?(\d{2})?$/, // 15.08.2011 15:30
	patternOrder :  [3, 2, 1, 4, 5], // year, month, day, hour, minute
	monthMessages : ['января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря'],

	dayMessages : {
		n : {
			0 : 'Сегодня',
			1 : 'Вчера',
			2 : '2 дня назад',
			3 : '3 дня назад',
			4 : '4 дня назад',
			21 : '21 день назад',
			22 : '22 дня назад',
			23 : '23 дня назад',
			24 : '24 дня назад',
			many : '%s дней назад'
		},
		p : {
			0 : 'Сегодня',
			1 : 'Завтра',
			2 : 'Через 2 дня',
			3 : 'Через 3 дня',
			4 : 'Через 4 дня',
			21 : 'Через 21 день',
			22 : 'Через 22 дня',
			23 : 'Через 23 дня',
			24 : 'Через 24 дня',
			many : 'Через %s дней'
		}
	},

	hourMessages : {
		n : {
			1 : '1 час назад',
			2 : '2 часа назад',
			3 : '3 часа назад',
			4 : '4 часа назад',
			21 : '21 час назад',
			22 : '22 часа назад',
			23 : '23 часа назад',
			24 : '24 часа назад',
			many : '%s часов назад'
		},
		p : {
			1 : 'Через 1 час',
			2 : 'Через 2 часа',
			3 : 'Через 3 часа',
			4 : 'Через 4 часа',
			21 : 'Через 21 час',
			22 : 'Через 22 часа',
			23 : 'Через 23 часа',
			24 : 'Через 24 часа',
			many : 'Через %s часов'
		}
	},

	minMessages : {
		n : {
			0 : 'Только что',
			1 : '1 минуту назад',
			2 : '2 минуты назад',
			3 : '3 минуты назад',
			4 : '4 минуты назад',
			21 : '21 минуту назад',
			22 : '22 минуты назад',
			23 : '23 минуты назад',
			24 : '24 минуты назад',
			31 : '31 минуту назад',
			32 : '32 минуты назад',
			33 : '33 минуты назад',
			34 : '34 минуты назад',
			41 : '41 минуту назад',
			42 : '42 минуты назад',
			43 : '43 минуты назад',
			44 : '44 минуты назад',
			51 : '51 минуту назад',
			52 : '52 минуты назад',
			53 : '53 минуты назад',
			54 : '54 минуты назад',
			many : '%s минут назад'
		},
		p : {
			0 : 'Только что',
			1 : 'Через 1 минуту',
			2 : 'Через 2 минуты',
			3 : 'Через 3 минуты',
			4 : 'Через 4 минуты',
			21 : 'Через 21 минуту',
			22 : 'Через 22 минуты',
			23 : 'Через 23 минуты',
			24 : 'Через 24 минуты',
			31 : 'Через 31 минуту',
			32 : 'Через 32 минуты',
			33 : 'Через 33 минуты',
			34 : 'Через 34 минуты',
			41 : 'Через 41 минуту',
			42 : 'Через 42 минуты',
			43 : 'Через 43 минуты',
			44 : 'Через 44 минуты',
			51 : 'Через 51 минуту',
			52 : 'Через 52 минуты',
			53 : 'Через 53 минуты',
			54 : 'Через 54 минуты',
			many : 'Через %s минут'
		}
	}

});